Documents/ЗаказНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказНаДоставку</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Document.ОтгрузкаТоваровКлиенту</xr:Item>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Доставка</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки25</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаДоставкиОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаДоставкиПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаДоПеревозчика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаДоставкиПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставкиПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияПеревозки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияПеревозкиОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>В базовых ЕИ</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Распоряжение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаДоставку25</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрокиДоставки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исходящая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Входящая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыДоставки25.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыДоставки25</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашимиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашКурьер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказНаДоставку/Ext/ManagerModule.bsl
//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив Из Строка - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("ДоставкаТоваров");
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументОбъект.ЗаказНаДоставку, ДокументСсылка.ЗаказНаДоставку - ссылка на документ или объект, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  СписокЗначений Из Строка, Структура - коллекция элементов - таблиц значений - данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаказНаДоставку") Тогда
		
		ДокументОбъект = Документ;
		ДокументСсылка = Документ.Ссылка;
		
	Иначе
		
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументСсылка = Документ;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений; // СписокЗначений из Строка
	
	ПолучитьДанныеДокумента(Запрос, ДокументСсылка);
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		ТекстЗапросаДоставкаТоваров(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект, ДопПараметры);
		
	КонецЕсли;
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	БизнесПроцессы.Задание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Описание логики ограничений прав доступа
//
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Отправитель)
	|	И ЗначениеРазрешено(Получатель)";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  Заказ - ДокументОбъект.ЗаказНаДоставку
//  НовыеСтрокиТоваров - Массив Из ДанныеФормыЭлементКоллекции, СтрокаТабличнойЧасти:
//  * Распоряжение - ОпределяемыйТип.РаспоряжениеНаДоставку25
//  * КодСтрокиДоставки - Число
//
Процедура ОбновитьДополнительныеПараметры(Заказ, НовыеСтрокиТоваров) Экспорт
	
	Распоряжения = Новый Массив; // Массив Из ОпределяемыйТип.РаспоряжениеНаДоставку25
	Для Каждого Строка Из НовыеСтрокиТоваров Цикл
		Распоряжения.Добавить(Строка.Распоряжение);
	КонецЦикла;
	
	ДопПараметрыНовыхСтрок = ДоставкаТоваров.ВсеДополнительныеПараметрыИзСтрокДокументов(Распоряжения);
	
	ДобавленныеВариантыОсобыхУсловий = Новый Соответствие;
	Если ЗначениеЗаполнено(Заказ.ОсобыеУсловияПеревозкиОписание) Тогда
		
		ХешТекущихОсобыхУсловий = ДоставкаТоваров.ХешЗначимыхСимволовСтроки(Заказ.ОсобыеУсловияПеревозкиОписание);
		ДобавленныеВариантыОсобыхУсловий.Вставить(ХешТекущихОсобыхУсловий, Истина);
		
	КонецЕсли;
	
	ДобавленныеВариантыДопИнформации = Новый Соответствие;
	Если ЗначениеЗаполнено(Заказ.ДополнительнаяИнформация) Тогда
		
		ХешТекущейДопИнформации = ДоставкаТоваров.ХешЗначимыхСимволовСтроки(Заказ.ДополнительнаяИнформация);
		ДобавленныеВариантыДопИнформации.Вставить(ХешТекущейДопИнформации, Истина);
		
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ДокументДоставки", Неопределено);
	Отбор.Вставить("КодСтроки", 0);
	
	ПустоеВремя = '00010101';
	НовоеВремяДоставкиС = ПустоеВремя;
	НовоеВремяДоставкиПо = ПустоеВремя;
	
	Для Каждого Строка Из НовыеСтрокиТоваров Цикл
		
		Отбор.ДокументДоставки = Строка.Распоряжение;
		Отбор.КодСтроки = Строка.КодСтрокиДоставки;
		СтрокиПараметров = ДопПараметрыНовыхСтрок.НайтиСтроки(Отбор);
		
		Если СтрокиПараметров.Количество() = 0 Тогда
			
			Отбор.КодСтроки = 0;
			СтрокиПараметров = ДопПараметрыНовыхСтрок.НайтиСтроки(Отбор);
			
		КонецЕсли;
		
		Если СтрокиПараметров.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДопПараметрыСтроки = СтрокиПараметров[0];
		
		Если ДопПараметрыСтроки.ВремяДоставкиС > НовоеВремяДоставкиС Тогда
			НовоеВремяДоставкиС = ДопПараметрыСтроки.ВремяДоставкиС;
		КонецЕсли;
		
		Если ДопПараметрыСтроки.ВремяДоставкиПо < НовоеВремяДоставкиПо
		   И ЗначениеЗаполнено(ДопПараметрыСтроки.ВремяДоставкиПо) Тогда
			
			НовоеВремяДоставкиПо = ДопПараметрыСтроки.ВремяДоставкиПо;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НовоеВремяДоставкиПо)
		   И ЗначениеЗаполнено(ДопПараметрыСтроки.ВремяДоставкиПо) Тогда
			
			НовоеВремяДоставкиПо = ДопПараметрыСтроки.ВремяДоставкиПо;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДопПараметрыСтроки.ОсобыеУсловияПеревозкиОписание)
		   И ДобавленныеВариантыОсобыхУсловий[ДопПараметрыСтроки.ОсобыеУсловияПеревозкиОписаниеХеш] = Неопределено Тогда
			
			Заказ.ОсобыеУсловияПеревозкиОписание = Заказ.ОсобыеУсловияПеревозкиОписание + Символы.ПС
				+ ДопПараметрыСтроки.ОсобыеУсловияПеревозкиОписание;
			
			ДобавленныеВариантыОсобыхУсловий.Вставить(ДопПараметрыСтроки.ОсобыеУсловияПеревозкиОписаниеХеш, Истина);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДопПараметрыСтроки.ДополнительнаяИнформацияПоДоставке)
		   И ДобавленныеВариантыДопИнформации[ДопПараметрыСтроки.ДополнительнаяИнформацияПоДоставкеХеш] = Неопределено Тогда
			
			Заказ.ДополнительнаяИнформация = Заказ.ДополнительнаяИнформация + Символы.ПС
				+ ДопПараметрыСтроки.ДополнительнаяИнформацияПоДоставке;
			
			ДобавленныеВариантыДопИнформации.Вставить(ДопПараметрыСтроки.ДополнительнаяИнформацияПоДоставкеХеш, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НовоеВремяДоставкиС > НовоеВремяДоставкиПо
	   И ЗначениеЗаполнено(НовоеВремяДоставкиПо) Тогда
		
		НовоеВремяДоставкиС = ПустоеВремя;
		НовоеВремяДоставкиПо = ПустоеВремя;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Заказ.ВремяДоставкиС)
	   И НЕ ЗначениеЗаполнено(Заказ.ВремяДоставкиПо) Тогда
		
		Заказ.ВремяДоставкиС = НовоеВремяДоставкиС;
		Заказ.ВремяДоставкиПо = НовоеВремяДоставкиПо;
		
	КонецЕсли;
	
	Заказ.ОсобыеУсловияПеревозкиОписание = СокрЛП(Заказ.ОсобыеУсловияПеревозкиОписание);
	Заказ.ДополнительнаяИнформация = СокрЛП(Заказ.ДополнительнаяИнформация);
	
	Если ЗначениеЗаполнено(Заказ.ОсобыеУсловияПеревозкиОписание) Тогда
		Заказ.ОсобыеУсловияПеревозки = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

#Область ДанныеДокумента

Процедура ПолучитьДанныеДокумента(Запрос, ДокументСсылка)
	
	СписокЗапросов = Новый Массив; // Массив из Строка
	
	ТекстЗапросаДанныеДокументаШапка(СписокЗапросов);
	ТекстЗапросаДанныеТаблицаТовары(СписокЗапросов);
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ТекстЗапросаДанныеДокументаШапка(СписокЗапросов)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.ПометкаУдаления КАК ПометкаУдаления,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ДанныеДокумента.НаправлениеДоставки КАК НаправлениеДоставки,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.СпособДоставки КАК СпособДоставки,
	|	ДанныеДокумента.ДоставкаДоПеревозчика КАК ДоставкаДоПеревозчика,
	|	ДанныеДокумента.Отправитель КАК Отправитель,
	|	ДанныеДокумента.ТочкаДоставкиОтправителя КАК ТочкаДоставкиОтправителя,
	|	ДанныеДокумента.ЗонаОтправления КАК ЗонаОтправления,
	|	ДанныеДокумента.Получатель КАК Получатель,
	|	ДанныеДокумента.ТочкаДоставкиПолучателя КАК ТочкаДоставкиПолучателя,
	|	ДанныеДокумента.ЗонаДоставки КАК ЗонаДоставки,
	|	ДанныеДокумента.Перевозчик КАК Перевозчик,
	|	ДанныеДокумента.ТочкаДоставкиПеревозчика КАК ТочкаДоставкиПеревозчика,
	|	ДанныеДокумента.ЗонаДоставкиПеревозчика КАК ЗонаДоставкиПеревозчика,
	|	ДанныеДокумента.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ДанныеДокумента.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	ДанныеДокумента.Ответственный КАК Ответственный,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ДанныеДокумента.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ДанныеДокумента.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание
	|ПОМЕСТИТЬ ДанныеДокументаШапка
	|ИЗ
	|	Документ.ЗаказНаДоставку КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДанныеТаблицаТовары(СписокЗапросов)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДанных.Ссылка КАК Ссылка,
	|	ТаблицаДанных.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ТаблицаДанных.Характеристика КАК Характеристика,
	|	ТаблицаДанных.Серия КАК Серия,
	|	ТаблицаДанных.Количество КАК Количество,
	|	ТаблицаДанных.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТаблицаДанных.Упаковка КАК Упаковка,
	|	ТаблицаДанных.Распоряжение КАК Распоряжение,
	|	ТаблицаДанных.КодСтрокиДоставки КАК КодСтрокиДоставки
	|ПОМЕСТИТЬ ДанныеДокументаТаблицаТовары
	|ИЗ
	|	Документ.ЗаказНаДоставку.Товары КАК ТаблицаДанных
	|ГДЕ
	|	ТаблицаДанных.Ссылка = &Ссылка";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Реквизиты = РеквизитыДокумента(Запрос);
	
	Для Каждого КлючИЗначение Из ЗначенияПараметровПроведения(Реквизиты) Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	УровеньОперации = ДоставкаТоваров.УровеньОперацииДокумента(ДокументСсылка);
	Запрос.УстановитьПараметр("УровеньОперации", УровеньОперации);
	
КонецПроцедуры

// Параметры:
//  Запрос - Запрос - Запрос
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Реквизиты документа:
//  * Дата - Дата
//  * Номер - Строка
//  * ПометкаУдаления - Булево
//  * Проведен - Булево
//  * ДатаОтгрузки - Дата
//  * НаправлениеДоставки - ПеречислениеСсылка.НаправленияДоставки
//  * Организация - СправочникСсылка.Организации
//  * СпособДоставки - ПеречислениеСсылка.СпособыДоставки25
//  * ДоставкаДоПеревозчика - Булево
//  * Перевозчик - СправочникСсылка.Партнеры
//  * Отправитель - СправочникСсылка.Склады
//  * ТочкаДоставкиОтправителя - СправочникСсылка.ТочкиДоставки
//  * Получатель - СправочникСсылка.Партнеры
//  * ТочкаДоставкиПолучателя - СправочникСсылка.ТочкиДоставки
//  * ЗонаДоставки - СправочникСсылка.ЗоныДоставки
//  * ТочкаДоставкиПеревозчика - СправочникСсылка.ТочкиДоставки
//  * ВремяДоставкиС - Дата
//  * ВремяДоставкиПо - Дата
//  * ОсобыеУсловияПеревозки - Булево
//  * Ответственный - СправочникСсылка.Пользователи
//
Функция РеквизитыДокумента(Запрос)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокументаШапка.Дата КАК Дата,
	|	ДанныеДокументаШапка.Номер КАК Номер,
	|	ДанныеДокументаШапка.ПометкаУдаления КАК ПометкаУдаления,
	|	ДанныеДокументаШапка.Проведен КАК Проведен,
	|	ДанныеДокументаШапка.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ДанныеДокументаШапка.НаправлениеДоставки КАК НаправлениеДоставки,
	|	ДанныеДокументаШапка.Организация КАК Организация,
	|	ДанныеДокументаШапка.СпособДоставки КАК СпособДоставки,
	|	ДанныеДокументаШапка.ДоставкаДоПеревозчика КАК ДоставкаДоПеревозчика,
	|	ДанныеДокументаШапка.Перевозчик КАК Перевозчик,
	|	ДанныеДокументаШапка.Отправитель КАК Отправитель,
	|	ДанныеДокументаШапка.ТочкаДоставкиОтправителя КАК ТочкаДоставкиОтправителя,
	|	ДанныеДокументаШапка.ЗонаОтправления КАК ЗонаОтправления,
	|	ДанныеДокументаШапка.Получатель КАК Получатель,
	|	ДанныеДокументаШапка.ТочкаДоставкиПолучателя КАК ТочкаДоставкиПолучателя,
	|	ДанныеДокументаШапка.ЗонаДоставки КАК ЗонаДоставки,
	|	ДанныеДокументаШапка.ТочкаДоставкиПеревозчика КАК ТочкаДоставкиПеревозчика,
	|	ДанныеДокументаШапка.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ДанныеДокументаШапка.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	ДанныеДокументаШапка.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ДанныеДокументаШапка.Ответственный КАК Ответственный
	|ИЗ
	|	ДанныеДокументаШапка КАК ДанныеДокументаШапка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Реквизиты = РезультатЗапроса.Выбрать();
	Реквизиты.Следующий();
	
	Возврат Реквизиты;
	
КонецФункции

// Параметры:
//  Реквизиты - См. РеквизитыДокумента
// 
// Возвращаемое значение:
//  Структура - Значения параметров для запроса
//
Функция ЗначенияПараметровПроведения(Реквизиты)
	
	Значения = Новый Структура;
	
	Значения.Вставить("Период", Реквизиты.Дата);
	Значения.Вставить("Организация", Реквизиты.Организация);
	Значения.Вставить("НаправлениеДоставки", Реквизиты.НаправлениеДоставки);
	Значения.Вставить("СпособДоставки", Реквизиты.СпособДоставки);
	Значения.Вставить("ДоставкаДоПеревозчика", Реквизиты.ДоставкаДоПеревозчика);
	Значения.Вставить("Отправитель", Реквизиты.Отправитель);
	Значения.Вставить("Получатель", Реквизиты.Получатель);
	Значения.Вставить("Перевозчик", Реквизиты.Перевозчик);
	Значения.Вставить("ТочкаДоставкиОтправителя", Реквизиты.ТочкаДоставкиОтправителя);
	Значения.Вставить("ТочкаДоставкиПолучателя", Реквизиты.ТочкаДоставкиПолучателя);
	Значения.Вставить("ТочкаДоставкиПеревозчика", Реквизиты.ТочкаДоставкиПеревозчика);
	Значения.Вставить("ЗонаДоставки", Реквизиты.ЗонаДоставки);
	Значения.Вставить("Ответственный", Реквизиты.Ответственный);
	Значения.Вставить("ОсобыеУсловияПеревозки", Реквизиты.ОсобыеУсловияПеревозки);
		
	Возврат Значения;
	
КонецФункции

Функция ТекстЗапросаДоставкаТоваров(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект, ДопПараметры = Неопределено)
	
	ИмяРегистра = "Доставка";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	НАЧАЛОПЕРИОДА(&Период, День) КАК Период,
	|	ШапкаЗаказа.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДоставки.Исходящая) КАК ТипДоставки,
	|	ШапкаЗаказа.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВЫБОР
	|		КОГДА ШапкаЗаказа.ДоставкаДоПеревозчика
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыДоставки25.НашимиСилами)
	|		ИНАЧЕ ШапкаЗаказа.СпособДоставки
	|	КОНЕЦ КАК СпособДоставки,
	|	ШапкаЗаказа.Отправитель КАК Отправитель,
	|	ШапкаЗаказа.ТочкаДоставкиОтправителя КАК ТочкаОтправителя,
	|	ШапкаЗаказа.ЗонаОтправления КАК ЗонаОтправителя,
	|	ВЫБОР
	|		КОГДА ШапкаЗаказа.ДоставкаДоПеревозчика
	|			ТОГДА ШапкаЗаказа.Перевозчик
	|		ИНАЧЕ ШапкаЗаказа.Получатель
	|	КОНЕЦ КАК Получатель,
	|	ВЫБОР
	|		КОГДА ШапкаЗаказа.ДоставкаДоПеревозчика
	|			ТОГДА ШапкаЗаказа.ТочкаДоставкиПеревозчика
	|		ИНАЧЕ ШапкаЗаказа.ТочкаДоставкиПолучателя
	|	КОНЕЦ КАК ТочкаПолучателя,
	|	ВЫБОР
	|		КОГДА ШапкаЗаказа.ДоставкаДоПеревозчика
	|			ТОГДА ШапкаЗаказа.ЗонаДоставкиПеревозчика
	|		ИНАЧЕ ШапкаЗаказа.ЗонаДоставки
	|	КОНЕЦ КАК ЗонаПолучателя,
	|	&Ссылка КАК ДокументПланирования,
	|	ТаблицаТовары.Распоряжение КАК Распоряжение,
	|	НЕОПРЕДЕЛЕНО КАК Рейс,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Серия КАК Серия,
	|	ТаблицаТовары.КодСтрокиДоставки КАК КодСтроки,
	|	1 КАК Плечо,
	|	ТаблицаТовары.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ШапкаЗаказа.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки25.СиламиПеревозчика)
	|			ТОГДА ШапкаЗаказа.Перевозчик
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	КОНЕЦ КАК Перевозчик,
	|	0 КАК КДоставке,
	|	ТаблицаТовары.Количество КАК КРейсу,
	|	ВЫБОР
	|		КОГДА ШапкаЗаказа.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки25.Самовывоз)
	|			ТОГДА ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВРейсе,
	|	0 КАК ВПути,
	|	ВЫБОР
	|		КОГДА ШапкаЗаказа.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки25.Самовывоз)
	|			ТОГДА ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Доставлено,
	|	0 КАК Отменено,
	|	0 КАК КСборке,
	|	0 КАК Собирается,
	|	0 КАК Собрано,
	|	&УровеньОперации КАК УровеньОперации,
	|	НЕ ШапкаЗаказа.ДоставкаДоПеревозчика КАК ЭтоКонечноеПлечо,
	|	1 КАК НомерМинимальногоПлеча,
	|	ЛОЖЬ КАК ПервичнаяЗапись,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПервичнаяДатаОтгрузки,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение
	|ИЗ
	|	Документ.ЗаказНаДоставку.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставку КАК ШапкаЗаказа
	|		ПО ТаблицаТовары.Ссылка = ШапкаЗаказа.Ссылка
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	НАЧАЛОПЕРИОДА(&Период, День) КАК Период,
	|	ШапкаЗаказа.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДоставки.Исходящая) КАК ТипДоставки,
	|	ШапкаЗаказа.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыДоставки25.СиламиПеревозчика) КАК СпособДоставки,
	|	ШапкаЗаказа.Перевозчик КАК Отправитель,
	|	ШапкаЗаказа.ТочкаДоставкиПеревозчика КАК ТочкаОтправителя,
	|	ШапкаЗаказа.ЗонаДоставкиПеревозчика КАК ЗонаОтправителя,
	|	ШапкаЗаказа.Получатель КАК Получатель,
	|	ШапкаЗаказа.ТочкаДоставкиПолучателя КАК ТочкаПолучателя,
	|	ШапкаЗаказа.ЗонаДоставки КАК ЗонаПолучателя,
	|	&Ссылка КАК ДокументПланирования,
	|	ТаблицаТовары.Распоряжение КАК Распоряжение,
	|	НЕОПРЕДЕЛЕНО КАК Рейс,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Серия КАК Серия,
	|	ТаблицаТовары.КодСтрокиДоставки КАК КодСтроки,
	|	2 КАК Плечо,
	|	ТаблицаТовары.Упаковка КАК Упаковка,
	|	ШапкаЗаказа.Перевозчик КАК Перевозчик,
	|	0 КАК КДоставке,
	|	ТаблицаТовары.Количество КАК КРейсу,
	|	0 КАК ВРейсе,
	|	0 КАК ВПути,
	|	0 КАК Доставлено,
	|	0 КАК Отменено,
	|	0 КАК КСборке,
	|	0 КАК Собирается,
	|	0 КАК Собрано,
	|	&УровеньОперации,
	|	ИСТИНА,
	|	0,
	|	ЛОЖЬ КАК ПервичнаяЗапись,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПервичнаяДатаОтгрузки,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение
	|ИЗ
	|	Документ.ЗаказНаДоставку.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставку КАК ШапкаЗаказа
	|		ПО ТаблицаТовары.Ссылка = ШапкаЗаказа.Ссылка
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ШапкаЗаказа.ДоставкаДоПеревозчика";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ЗаказНаДоставку.Товары", "ДанныеДокументаТаблицаТовары");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ЗаказНаДоставку КАК ШапкаЗаказа", "ДанныеДокументаШапка КАК ШапкаЗаказа");
		
	СинонимТаблицыДокумента = "ТаблицаТовары";
	ДоставкаТоваров.УстановитьПараметрыЗапросаПроведения(Запрос, ДопПараметры);
	ДоставкаТоваров.ДополнитьЗапросОтраженияДокумента(Запрос, Регистры, ТекстыЗапроса, ТекстЗапроса, СинонимТаблицыДокумента);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  Неопределено, СтрокаТаблицыЗначений - Добавить команду создать на основании
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	КомандаСоздатьНаОсновании = Неопределено;
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ЗаказНаДоставку) Тогда
		
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ЗаказНаДоставку.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление =
			ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ЗаказНаДоставку);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "НеИспользоватьУправлениеДоставкой20";
		
	КонецЕсли;
	
	Возврат КомандаСоздатьНаОсновании;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
